#+title: Starlink status
#+date: 2025-08-27T10:53:00
#+draft: true

I have a starlink mini in my car, which is cool, but 
#+begin_src bash
  brew install grpcurl

#+end_src

Then ask it

#+begin_src bash :results output
  grpcurl -plaintext -d '{"get_status":{}}' 192.168.100.1:9200 SpaceX.API.Device.Device/Handle
#+end_src

#+RESULTS:
#+begin_example
{
  "apiVersion": "38",
  "dishGetStatus": {
    "deviceInfo": {
      "id": "ut00680106-87c1011c-d886d132",
      "hardwareVersion": "mini1_prod2",
      "softwareVersion": "2025.08.09.mr61440",
      "countryCode": "US",
      "utcOffsetS": -18000,
      "bootcount": 1926,
      "generationNumber": "1755210683",
      "buildId": "acae5ab4-4e25-41a0-940d-b35679292f9f.uterm_catapult_manifest.release"
    },
    "deviceState": {
      "uptimeS": "386"
    },
    "obstructionStats": {
      "fractionObstructed": 0.0019607844,
      "validS": 283,
      "avgProlongedObstructionIntervalS": "NaN",
      "patchesValid": 1530
    },
    "alerts": {
      "roaming": true
    },
    "downlinkThroughputBps": 173249.92,
    "uplinkThroughputBps": 129285.23,
    "popPingLatencyMs": 22.115126,
    "boresightAzimuthDeg": 150.57686,
    "boresightElevationDeg": 87.59529,
    "gpsStats": {
      "gpsValid": true,
      "gpsSats": 14
    },
    "ethSpeedMbps": 1000,
    "mobilityClass": "MOBILE",
    "isSnrAboveNoiseFloor": true,
    "readyStates": {
      "scp": true,
      "l1l2": true,
      "xphy": true,
      "aap": true,
      "rf": true
    },
    "softwareUpdateState": "IDLE",
    "hasActuators": "HAS_ACTUATORS_NO",
    "disablementCode": "OKAY",
    "hasSignedCals": true,
    "softwareUpdateStats": {
      "softwareUpdateState": "IDLE"
    },
    "alignmentStats": {
      "hasActuators": "HAS_ACTUATORS_NO",
      "tiltAngleDeg": 3.0369658,
      "boresightAzimuthDeg": 150.57686,
      "boresightElevationDeg": 87.59529,
      "attitudeEstimationState": "FILTER_UNCONVERGED",
      "attitudeUncertaintyDeg": 9.899634,
      "desiredBoresightAzimuthDeg": 63.097248,
      "desiredBoresightElevationDeg": 67.00226
    },
    "initializationDurationSeconds": {
      "attitudeInitialization": 40,
      "burstDetected": 40,
      "ekfConverged": 40,
      "firstCplane": 42,
      "firstPopPing": 57,
      "gpsValid": 28,
      "initialNetworkEntry": 41,
      "networkSchedule": 46,
      "rfReady": 24,
      "stableConnection": 1
    },
    "secondsUntilSwupdateRebootPossible": -1,
    "connectedRouters": [
      "Router-0100000000000000009993AC"
    ],
    "plcStats": {
      "port1Stats": {},
      "port2Stats": {},
      "port3Stats": {}
    },
    "upsuStats": {},
    "dlBandwidthRestrictedReason": "NO_LIMIT",
    "ulBandwidthRestrictedReason": "NO_LIMIT",
    "apsStats": {},
    "ned2dishQuaternion": {
      "qScalar": 0.020956341,
      "qX": -0.5348239,
      "qY": -0.84470296,
      "qZ": 0.0010677704
    },
    "downstreamRouters": {
      "Router-0100000000000000009993AC": {
        "role": "CONTROLLER",
        "lastSeen": "1756306451069660042"
      }
    },
    "config": {
      "swupdateRebootHour": 3,
      "applySnowMeltMode": true,
      "applyLocationRequestMode": true,
      "applyLevelDishMode": true,
      "applyPowerSaveStartMinutes": true,
      "applyPowerSaveDurationMinutes": true,
      "applyPowerSaveMode": true,
      "applySwupdateThreeDayDeferralEnabled": true,
      "applyAssetClass": true,
      "applySwupdateRebootHour": true
    }
  }
}
#+end_example

